###################################################### 注释 ######################################################
# 1. 单行注释用井号

'''
2. 多行注释方式一
多行注释方式一: 英文3个单引号
'''

"""
2. 多行注释方式二
多行注释方式二：英文3个双引号
"""


# 多行注释写在方法体内，可以便于mouse hover显示描述
def get_data_from_database(method, row):
    """这个函数用于从数据库中提取若干条数据
    args:
        method:获取数据的方法
        row:获取的数据行数
    ret:
        True/False
    """


get_data_from_database()
###################################################### 注释 ######################################################
