###################################################### 变量名规则、语句层次 ######################################################
# 单下划线开头 - 不能直接访问的类属性，如：_classProperty
# 双下划线开头 - 私有属性，如：__privateProperty
# 双下划线开头和结尾 - 特殊方法，如：__init()__

'''
语句间断行
代码块直接使用缩进表示代码层次关系
'''
###################################################### 变量名规则、语句层次 ######################################################


###################################################### 字符串表示方式 ######################################################
print('字符串表示方式一：单引号')
print("字符串表示方式二：双引号")
print('''字符串表示方式三：三引号 - 可以跨行号
字符串表示方式三：三引号 - 可以跨行号
''')

# 字符串长度
print("English的长度，len('English'): %s" % len('English'))

# 字符串拼接1 -- 占位符：%s %d 字符串 placeholder
print("python计算数据，直接输入数字和运算符号可得到结果，如输入2+3运行得到结果：%d" % (2 + 3))
print("I'm %s and %d years old!" % ('Zara', 21))

'''
练习1
'''
# name = input("请输入你的姓名：")
# age = int(input("请输入你的年龄："))
# welcome = "%s, %d岁, 欢迎参加本次课程" % (name, age)
# print(welcome)

'''
练习2
%02d - 小数点前，保留2位整数
%.04f - 小数点后，保留4位小数
'''
month = 8
day = 21
print("month = %02d  day = %d   today is %02d/%d" % (month, day, month, day))

# 字符串拼接2 -- join 方法 - 中间插入指定字符串
joinStr = " - ".join(["欢迎", "参加", "本次课程"])
print(joinStr)
###################################################### 字符串表示方式 ######################################################
