###################################################### 数据类型 ######################################################
"""
整型 (int)
长整型 (long int)
浮点型 (float)
复数 (complex)
"""

print("四则运算 - “+”, 20+10：%d" % (20 + 10))
print("四则运算 - “-”, 20-10：%d" % (20 - 10))
print("四则运算 - “*”, 20*10：%d" % (20 * 10))
print("四则运算 - “/”, 20/10：%d" % (20 / 10))
print("四则运算 - “//”(整除数), 9//4：%d" % (9 // 4))
print("幂运算：2的3次方 - “2**3” 或 “pow(2,3)”, 2**3：%d" % (2 ** 3))
print("幂运算：2的3次方 - “2**3” 或 “pow(2, 3)”, pow(2,3)：% d" % pow(2, 3))

# 进制转换
print("二进制 - 5转换成%s" % bin(5))
print("十进制 - 10转换成%s" % oct(10))
print("十六进制 - 30转换成%s" % hex(30))

# 类型转换
print("类型转换：字符串 -> 数字，如‘55’字符串转成数字, int(55)： %d" % int(55))
print("类型转换：4.9取整数，int(4.9): %d" % int(4.9))
print("类型转换：4.9取整四舍五入，round(4.9): %d" % round(4.9))
###################################################### 数据类型 ######################################################
