########################################  求圆柱体对体积 pi*r**2*h ########################################
from math import pi


def get_volume(r, h):
    return pi*r**2*h


print(get_volume(1, 1))
########################################  求圆柱体对体积 pi*r**2*h ########################################


######################################## 设置默认的参数时，不用列表 ########################################
# 形参位于方法定义()内，实参位于实际调用方法传入的实际参数
# 设置默认的参数时，不用列表

def increase_1(item, l=[]):
    l.append(item)
    print(l)
    return l


increase_1(10)
increase_1(10)
######################################## 设置默认的参数时，不用列表 ########################################


def increase_2(item, L=None):
    if not L:
        L = []
    L.append(item)
    print(L)
    return L


increase_2(5)
increase_2(5)
######################################## 设置默认的参数时，不用列表 ########################################


######################################## 设置默认的初始值 height=0, weight=0 ########################################
def record_ppl(name, age, height=0, weight=0):
    print(name)
    print(age)


record_ppl('Tom', 20)
######################################## 设置默认的初始值 height=0, weight=0 ########################################


######################################## *args - 形参可变长未知参数（元组类型） ########################################
def record_ppl_2(name, age, *args):
    print('%s is %s now,' % (name, age))
    print(args)


record_ppl_2('Tom', 30)
record_ppl_2('Tom', 20, 175, 60)
######################################## *args - 形参可变长未知参数（元组类型） ########################################


######################################## **kwargs - 形参可变长关键字参数（字典类型） ########################################
def record_ppl_3(name, age, *args, **kwargs):
    print('%s is %s now,' % (name, age))
    print(args)
    print(kwargs)


record_ppl_3('Candy', 20)
record_ppl_3('Candy', 20, 175, 60, city='sz', number=66)

######################################## **kwargs - 形参可变长关键字参数（字典类型） ########################################


######################################## 多个返回值 - tuple元组格式 ########################################
def multi_ret():
    return True, False


print(multi_ret())
######################################## 多个返回值 - tuple元组格式 ########################################


######################################## 函数嵌套 ########################################
def foo():
    print("foo")


def bar(func):
    print("bar")
    return foo


ret = bar(foo)
print(ret)
######################################## 函数嵌套 ########################################
