###################################################### dict/ set ######################################################
# 只有key的字典，将为当成set，无法再赋值
onlyKeysDict = {"name", "age", "city"}
print(onlyKeysDict)
###################################################### dict/ set ######################################################

# Set 不可重复, 如有值重复，默认会去重
# s0 - {5}
s0 = {5, 5, 5, 5, 5}
print(s0)

s1 = {1, 2, 3, 4}
s2 = {3, 4, 5, 6}

# 取交集 - set1 & set2
print(s1 & s2)

# 取并集(去重) - set1 | set2
print(s1 | s2)

# 取s1的值，且值不包含s2 -- s1-s2
print(s1 - s2)
print(s2 - s1)


''' 练习题
A公司员工参加的户外活动有：篮球、乒乓球、棒球
B公司员工参加的户外活动有：乒乓球、棒球、羽毛球
找出两公司员工共同参加的户外活动
'''
list_a = ["篮球", "乒乓球", "棒球"]
list_b = ["乒乓球", "棒球", "羽毛球"]
list_common = []
comset = list(set(list_a) & set(list_b))
print(comset)
